<?php
$config	= array(  
	// 'CSVURL'             =>$_SERVER['DOCUMENT_ROOT'].'\App3\tpl\Admin\Public\csv\SFCSV\\',  //csv文件保存路径
	// 'CSVURL'             => ADMIN_ABS_FILE,	//csv文件保存路径
	'TMPL_PARSE_STRING'  =>array(
		  '__PUBLIC__'         => ADMIN_JCM . '/Public', // 更改默认的/Public 替换规则
	),
	'URL_DISPATCH_ON'    => 0,//路由功能
	'URL_MODEL'          => 2,	//URL模式  用于中文字搜索时不会乱码  测试对数的时候需要用2模式才能正常浏览
	// 'DEFAULT_THEME'      => 'View',	//设置默认的模板主题
	'DEFAULT_CONTROLLER' =>'Login',	//默认控制器

	'URL_HTML_SUFFIX'    => '',//去除.html后缀

	//默认分页显示数量
	'EPAGE' => 20,
	//余下的电子单数量提醒
	'WARNING' => 1500,

	//个人注册/企业注册 审核不通过类型
	'WrongType' => array(
	    '3' => '个人/企业信息',
	    '4' => '证件照片',
	 ),

	//文件导出类型  暂时只有 批号对数--中转跟踪 使用
	'Export_Type' => array(
		'csv'  =>'CSV',
		'2003' =>'Excel2003',
		'2007' =>'Excel2007',
	),

	// 批号对数 --- 完成某个订单的select标签的val  20160315
	// 说明：除了 1.select标签的val="2010"且勾选【完成此单】的特定条件下才会更新mk_tran_list.IL_state，ex_time，ex_context;
	// 			  2.不管选择select标签中的任何value(除了1中所述)，一旦勾选了“完成此单”，则更新mk_tran_list.IL_state为1003，但不更新ex_time，ex_context；
	// 			  3.否则，只会在mk_il_logs中新增记录，而不对mk_tran_list作任何操作。
	'LOGARTHM_SELECT' => array(
		'1400' 	=> '包裹清关中', // 20170112 Jie
		'2001'  => '已签收',
		'2012'	=> '感谢使用美快国际物流，期待下次为您服务',
		'2014'	=> '已签收,感谢使用美快国际物流，期待下次为您服务',

		'2011'	=> '收件人年度海淘金额超出总署限额，退运寄件人',
		'2002'  => '已退回寄件人',
		'2003'  => '将按程序退回寄件人',

		'2015' => '【宁波口岸】发送订单信息到电子口岸',
		'2007'  => '海关查验中',
		'2004'  => '清关过程中被海关扣押',
		'2009'  => '清关过程中被海关抽检',
		'2013'	=> '收件人被海关封号，请收件人配合提交相关资料并耐心等待解封',		

		'2005'  => '外包装破损，丢弃处理',
		'2006'  => '内件破损，丢弃处理',
		'2008'  => '已作丢失处理',

		'2000'  => '其它自定义',
		'2010'  => '已完成',   //增加一个“已完成”，功能：在物流记录中，不出现内容，但将状态改为1003，ex_context(time)要更改内容为“XXX”执行完成操作 20160728 jie

		'200' 	=> '已发往申通香港分公司', // 20170112 Jie
	),
	//商品报备对应的编码与说明
	'Customs_Code' => array(
		'0' => '报备失败',
		'1' => '报备成功',
		'3' => '误报(说明,海关返回报备不成功)',
		'8' => '已报备',
		'9' => '报备中',
	),
	// SFLogistics控制器 状态说明 20161128 Jie
	'state_arr' => array(
		'00' => '未申报',
		'01' => '库存不足',
		'02' => '发仓库配货',
		'03' => '仓库已配货',
		'11' => '已报国检',
		'12' => '国检放行',
		'13' => '国检审核未过',
		'14' => '国检抽检',
		'21' => '已报海关',
		'22' => '海关单证放行',
		'23' => '海关单证审核未过',
		'24' => '海关货物放行',
		'25' => '海关查验未过',
		'99' => '已关闭',
	),
	// 快件管理 对数
    'ilstarr' => array(
		array('8','未揽收'),			//0
		array('12','已揽收未中转'),		//1
		array('16','已中转因故返仓'),	//2
		array('20','已中转未到港'),		//3
		array('200','到港并发快递'),	//4
		array('1001','快递揽件'),		//5
		array('1000','快递在途'),		//6
		array('1005','快递派件中'),		//7
		array('1002','快递疑难'),		//8
		array('1003','快递签收'),		//9
		array('1004','退回'),			//10
		array('1006','拒收退回'),		//11
		array('1012','快递延迟'),		//12   Jie 20161013
		array('1400','清关中'),			//13   Jie 20161209
		array('1410','已出关'),			//14   Jie 20161209
	),
	'ilstarri' => array('8'=>0,'12'=>1,'16'=>2,'20'=>3,'200'=>4,'1001'=>5,'1000'=>6,'1005'=>7,'1002'=>8,'1003'=>9,'1004'=>10,'1006'=>11,'1012'=>12,'1400'=>13,'1410'=>14),

	// HkEms控制器 状态说明 20170119 Jie
	'state_Hkems' => array(
		'10' => '查验',
		'20' => '扣关',
		'30' => '退运',
		'40' => '未缴款',
		'50' => '已缴款',
		'60' => '放行',
	),

	// 广东邮政 支付通知状态
	'SendPayStateList' => array(
		'0' => '等待发送海关',
		'1' => '已提交发送海关',
		'2' => '海关返回受理成功',
	),
	
	// 广东邮政 报关状态
	'CustomStateList' => array(
		'0'   => '未发送',
		'1'   => '已发送',
		'200' => '已审核',
		'400' => '有误',
	),

	//定义 中通 节点推送的阶段编码  固定顺序
	'ZT_Node_Point' => array(
		//'Verified'      => '审单',
		'WarehouseIn'   => '仓库入库',
		'Weigh'   		=> '称重',
		'Consolidated'  => '仓库出库',
		'Departure'     => '航班起飞',
		'Arrival'       => '航班落地',
		'InBondPicking' => '海关提货',
		'InBondDeclare' => '清关开始，清关中'
	),

	//定义 中通 节点推送的 时间间隔   分钟
	'ZT_Node_Point_Time_Limit' => array('180','0','10','90','1500','60','30'),

	// 充值方式 20171228
	'Pay_Kind' => array(
		'wechat'      => '微信',//微信
		'alipay'      => '支付宝',//支付宝
		'cash'        => '现金',//现金
		'credit_card' => '信用卡',//信用卡
		'other'       => '其他',//其他
		'paypal'      => 'paypal',//paypal
	),

	/*============================Hua start	=================================================*/

	//权限管理设置	start
		//权限验证设置
		'AUTH_CONFIG'=>array(
	        'AUTH_ON' => true, //认证开关
	        'AUTH_TYPE' => 1, // 认证方式，1为时时认证；2为登录认证。
	        'AUTH_GROUP' => 'mk_auth_group', //用户组数据表名
	        'AUTH_GROUP_ACCESS' => 'mk_auth_group_access', //用户组明细表
	        'AUTH_RULE' => 'mk_auth_rule', //权限规则表
	        'AUTH_USER' => 'mk_manager_list'//用户信息表
	    ),
	//权限管理设置 	end
		
	
    //'RAPIURL' =>'http://www.beautyfast.com/Api/',	//读取行为的url
	//'WAPIURL' =>'http://api.loc.mk:82/',	//操作行为的url	
	
	
	
	
	
	
	
	/*============================Hua end =================================================*/
	
	/*============================hua 收件人身份证管理	start=================================*/	
	//信息审核状态
	'ID_CARD_STATUS' => array(
		'0'			=> '未审核',    
	    '10'		=> '已通过审核',   
	    '2'			=> '未通过审核',  
	),

    //失效状态
    'ID_CARD_FAILURE_STATUS' => array(
        '1'			=> '否',
        '2'			=> '是',
    ),




	"UPLOAD_TYPE"			=> '',
    //配置存放路径：
    "UPLOAD_DIR"			=> ADMIN_ABS_FILE,
    //"UPLOAD_DIR"			=> 'D:/sys/www/upfiles/b',
    'ADMIN_URL'				=> ADMIN_FILE,
    //"UPLOAD_DIR"=>'Public/imageProduct',
    //配置上存文件大小：
    "UPLOAD_SIZE"			=> 1024*1024*10,
    "UPLOAD_NAME" 			=> '/Admin_idcard/',
	"ORDER_LOG"           => '/order_log/',     //修改订单身份证图片日志
	"COMMENT_NAME" 			=> '/Admin_comment/',    
	/*============================hua 收件人身份证管理	end=================================*/	
	    
	/*==============================地区信息上传		start====================================*/
	'UPLOAD_DIRS' => PY_UPFILE,
	/*==============================地区信息上传		end====================================*/
	    
	
	/**==============================会员提现	start====================================**/
	'WITHD_STATUS'		=> array(
			'0'			=> '未审核',
			'1'			=> '待确认',
			'2'			=> '已完成',
			'3'			=> '已取消',
	),
	
	'Pay_EAGE' => 10,	//消费|充值记录显示数目
	
	'Pay_Kind_alias' => array(
		'1'		=>	'wechat',
		'2'		=>	'alipay',
		'3'		=>	'cash',
		'4'		=>	'credit_card',
		'5'		=>	'paypal',
		'6'		=>	'other',
	),
	//订单支付状态
	'PAY_STAT'	=> array(
		'0'		=> '待支付',
		'1'		=> '已支付',
	),
	
	'PAY_MODE' => array(
		'1'		=> '支付宝',
		'2'		=> '微信',
		'3'		=> 'paypal',
	),
	
	
	
	/**==============================会员提现	end====================================**/
	
	/*===============================通告管理	start===================================*/
	'VIEW_TO' => array(
		'1'	  	=> '操作员',
		'2'		=> '会员',
		'3'		=> '官网', 
		'4'		=> '物流信息界面',
	),
	'LANG_CAT' => array(
		'zh-cn'	=> '中文',
		'en-cn'	=> '英文',
	),
	
	
	/*===============================通告管理	end===================================*/

    /*===============================财务管理---流水账本-- 消费记录--支付类型   start=============================*/
    'USER_PAY_STATUS' => array(
        '0'     => '消费',
        '1'     => '补扣',
        '2'     => '退款',

    ),


    /*===============================财务管理---流水账本-- 消费记录--支付类型   end=============================*/



);
return $config;